src/XMLtemplates/104-04_1G_AirTicket_Rq.xml

<!--Release 8.1--><!--Version Dated as of 15/Apr/2015 11:24:08-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header/>
    <soap:Body>
        <air:AirTicketingReq AuthorizedBy="user" ReturnInfoOnFail="true" TargetBranch="{{TargetBranch}}" TraceId="{{requestId}}" xmlns:air="http://www.travelport.com/schema/air_v33_0">
            <com:BillingPointOfSaleInfo OriginApplication="uAPI" xmlns:com="http://www.travelport.com/schema/common_v33_0"/>
            <air:AirReservationLocatorCode>{{ReservationLocator}}</air:AirReservationLocatorCode>
            {{#refs}}
            <air:AirPricingInfoRef Key="{{key}}"/>
            {{/refs}}
        </air:AirTicketingReq>
    </soap:Body>
</soap:Envelope>